Revit 2026 API

# LoadCombinationGetUsageIds Method

---

Returns collection of the load combination usage IDs.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetUsageIds()
```
```vb
Public Function GetUsageIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetUsageIds()
```
```fsharp
member GetUsageIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId A collection of the load combination usage IDs.

#### Reference

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace